{
  "health": "ok",
  "resumes": [
    {
      "id": "1",
      "title": "threads",
      "description": "Threads são como diferentes tarefas que um programa pode realizar ao mesmo tempo. Imagine que você está cozinhando: enquanto a panela está no fogo, você também está cortando os ingredientes. Essas duas ações podem acontecer ao mesmo tempo, assim como as threads permitem que um programa faça várias coisas simultaneamente. Cada thread é como uma linha de atividade separada dentro do programa, permitindo que ele seja mais eficiente e responsivo. No entanto, é importante coordenar essas atividades para evitar que elas atrapalhem umas às outras. Isso é feito usando técnicas especiais para garantir que as threads não interfiram umas nas outras enquanto compartilham recursos, como dados ou arquivos.\nteste atualize funcionando bem",
      "topic": [
        1,
        2
      ]
    },
    {
      "id": "2",
      "title": "processos",
      "description": "Processos são programas em execução no computador. Cada processo tem seu próprio espaço de memória, que inclui o código do programa, dados e recursos temporários. Eles funcionam de forma independente, o que significa que podem executar diferentes tarefas simultaneamente sem interferir um no outro. Por exemplo, você pode estar escrevendo um documento enquanto ouve música em um player de mídia, e ambos os aplicativos são processos separados. O sistema operacional é responsável por gerenciar esses processos, atribuindo recursos, como CPU e memória, e garantindo que cada um execute de forma eficiente e segura. Os processos podem se comunicar entre si, geralmente através de mecanismos fornecidos pelo sistema operacional, como sinais, pipes ou sockets, permitindo a cooperação entre diferentes partes de um sistema computacional.",
      "topic": [
        1,
        2
      ]
    },
    {
      "id": "[object Undefined]",
      "title": "crie resumo",
      "description": "teste"
    }
  ],
  "flashcards": [
    {
      "id": "1",
      "pergunta": "o que é software",
      "resposta": "software é composto por instruções de computador, estrutura de dados e documentação como um manual do software",
      "topico": [
        1
      ]
    },
    {
      "id": "2",
      "pergunta": "o que é mercado",
      "resposta": "abrange a negociação dos compradores e vendedores de um determinado produto",
      "topico": [
        4
      ]
    },
    {
      "id": "3",
      "pergunta": "o que é Bem normal e bem inferior",
      "resposta": "um bem normal a demanda varia no mesmo sentido que a renda, já em um bem inferior a demanda é o oposto da renda (carne e batata)",
      "topico": [
        4
      ]
    },
    {
      "id": "4",
      "pergunta": "quando há um aumento no custo de produção há",
      "resposta": "uma queda da oferta",
      "topico": [
        4
      ]
    },
    {
      "id": "5",
      "pergunta": "qual a diferença de fragmentar e icrementar no Scrum",
      "resposta": "fragmentar é dividir uma tarefa em varias já no icrementar do scrum uma tarefa pode ser dividida em duas mas a primeira deve cumprir o requisito minimo viável",
      "topico": [
        3
      ]
    }
  ],
  "topicos": [
    {
      "id": "1",
      "name": "computer science"
    },
    {
      "id": "2",
      "name": "OS"
    },
    {
      "id": "3",
      "name": "engenharia de software"
    },
    {
      "id": "4",
      "name": "economia"
    },
    {
      "id": "8",
      "name": "continuando"
    }
  ],
  "users": ""
}